[{
        "_id": "5d713995b721c3bb38c1f5d0",
        "user": "5d7a514b5d2c12c7449be045",
        "name": "Tacos",
        "averageRating": 5,
        "serving": 4,
        "calories": 305,
        "cousine": "Mexican",
        "meat": true,
        "time": 25,
        "photo": "no_photo.jpg",
        "description": "These crispy ground beef tacos are filled with seasoned meat, lettuce, cheese and tomatoes. An easy dinner recipe that the whole family will enjoy, even your pickiest eaters! Includes a recipe for ground beef taco seasoning.",
        "ingredients": ["2 teaspoons vegetable oil",
            "1 pound lean ground beef I use 90% lean",
            "1/2 cup onion finely chopped",
            "1 tablespoon chili powder",
            "1/4 teaspoon garlic powder",
            "1/4 teaspoon onion powder",
            "1/4 teaspoon crushed red pepper flakes optional",
            "1/4 teaspoon dried oregano",
            "1/2 teaspoon smoked paprika",
            "1 teaspoon ground cumin",
            "1 teaspoon salt",
            "1/2 teaspoon pepper",
            "1 14 ounce can petite diced tomatoes drained",
            "8 taco shells",
            "assorted toppings such as lettuce", "tomato", "onion", "shredded cheese"
        ],
        "instructions": "Heat the oil in a large pan over medium high heat. Add the ground beef and break up with a spatula. Add the onion to the pan. Cook, stirring occasionally, until beef is done and onion is soft, 5-6 minutes. Drain off any excess fat. Add the chili powder, garlic powder, onion powder, red pepper flakes, oregano, smoked paprika, cumin, salt and pepper to the pan. Stir to coat the meat in the seasonings. Add the tomatoes to the pan and simmer for 2-3 minutes. Spoon the beef into the taco shells and add toppings such as lettuce, tomatoes and cheese. Serve immediately."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d1",
        "user": "5d7a514b5d2c12c7449be046",
        "name": "BBQ NY Strip",
        "averageRating": 4.5,
        "serving": 4,
        "calories": 586,
        "cousine": "American",
        "meat": true,
        "time": 120,
        "photo": "no_photo.jpg",
        "description": "A quick and easy way to make a tasty, tender steak on the grill! Marinate for a minimum of 2 hours.",
        "ingredients": ["1/2 cup extra virgin olive oil", "1/2 cup Worcestershire sauce", "1/4 cup minced garlic", "1/4 cup steak seasoning1 tablespoon red wine vinegar", "1/2 teaspoon dried basil", "1/2 teaspoon Italian seasoning", "4 (1/2 pound) New York strip steaks"],
        "instructions": "In a bowl, mix the olive oil, Worcestershire sauce, garlic, steak seasoning, red wine vinegar, basil, and Italian seasoning. Pour into a large resealable plastic bag. Pierce steaks on all sides with a fork, and place in the bag. Gently shake to coat. Seal bag and marinate steaks a minimum of 2 hours in the refrigerator. Preheat grill for high heat. Lightly oil the grill grate.Discard marinade.Place steaks on the grill, and cook 7 minutes on each side, or to desired doneness."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d2",
        "user": "5d7a514b5d2c12c7449be044",
        "name": "Fettuccini Carbonara",
        "averageRating": 4.6,
        "serving": 6,
        "calories": 614,
        "cousine": "Italian",
        "meat": true,
        "time": 35,
        "photo": "no_photo.jpg",
        "description": "This carbonara is a delectable, mouth watering pile of yummy goodness. I recommend a nice salad with it - that's all you will need for a complete meal.",
        "ingredients": ["5 teaspoons olive oil", "4 shallots, diced", "1 large onion, cut into thin strips", "1 pound bacon, cut into strips", "1 clove garlic, chopped", "1 (16 ounce) package fettuccini pasta", "3 egg yolks", "1/2 cup heavy cream", "3/4 cup shredded Parmesan cheese"],
        "instructions": "Heat olive oil in a large heavy saucepan over medium heat. Saute shallots until softened. Stir in onion and bacon, and cook until bacon is evenly browned. Stir in garlic when bacon is about half done. Remove from heat. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente. Drain pasta, then return it to the pot.In a medium bowl, whisk together egg yolks, cream, and shredded Parmesan. Pour the bacon mixture over the pasta, then stir in the cream mixture. Season with salt and pepper."
    }
]