[{
        "_id": "5d713995b721c3bb38c1f5d0",
        "user": "5d713995b721c3bb38c1f5d0",
        "name": "Tacos",
        "averageRating": 1,
        "serving": 4,
        "calories": 305,
        "cousine": "Mexican",
        "meat": true,
        "time": 25,
        "photo": "photo_5d7a514b5d2c12c7449be045.jpg",
        "description": "These crispy ground beef tacos are filled with seasoned meat, lettuce, cheese and tomatoes. An easy dinner recipe that the whole family will enjoy, even your pickiest eaters! Includes a recipe for ground beef taco seasoning.",
        "ingredients": ["2 teaspoons vegetable oil",
            "1 pound lean ground beef I use 90% lean",
            "1/2 cup onion finely chopped",
            "1 tablespoon chili powder",
            "1/4 teaspoon garlic powder",
            "1/4 teaspoon onion powder",
            "1/4 teaspoon crushed red pepper flakes optional",
            "1/4 teaspoon dried oregano",
            "1/2 teaspoon smoked paprika",
            "1 teaspoon ground cumin",
            "1 teaspoon salt",
            "1/2 teaspoon pepper",
            "1 14 ounce can petite diced tomatoes drained",
            "8 taco shells",
            "assorted toppings such as lettuce", "tomato", "onion", "shredded cheese"
        ],
        "instructions": "Heat the oil in a large pan over medium high heat. Add the ground beef and break up with a spatula. Add the onion to the pan. Cook, stirring occasionally, until beef is done and onion is soft, 5-6 minutes. Drain off any excess fat. Add the chili powder, garlic powder, onion powder, red pepper flakes, oregano, smoked paprika, cumin, salt and pepper to the pan. Stir to coat the meat in the seasonings. Add the tomatoes to the pan and simmer for 2-3 minutes. Spoon the beef into the taco shells and add toppings such as lettuce, tomatoes and cheese. Serve immediately."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d1",
        "user": "5d713995b721c3bb38c1f5d0",
        "name": "BBQ NY Strip",
        "averageRating": 1,
        "serving": 4,
        "calories": 586,
        "cousine": "American",
        "meat": true,
        "time": 120,
        "photo": "photo_5d713995b721c3bb38c1f5d1.jpg",
        "description": "A quick and easy way to make a tasty, tender steak on the grill! Marinate for a minimum of 2 hours.",
        "ingredients": ["1/2 cup extra virgin olive oil", "1/2 cup Worcestershire sauce", "1/4 cup minced garlic", "1/4 cup steak seasoning1 tablespoon red wine vinegar", "1/2 teaspoon dried basil", "1/2 teaspoon Italian seasoning", "4 (1/2 pound) New York strip steaks"],
        "instructions": "In a bowl, mix the olive oil, Worcestershire sauce, garlic, steak seasoning, red wine vinegar, basil, and Italian seasoning. Pour into a large resealable plastic bag. Pierce steaks on all sides with a fork, and place in the bag. Gently shake to coat. Seal bag and marinate steaks a minimum of 2 hours in the refrigerator. Preheat grill for high heat. Lightly oil the grill grate.Discard marinade.Place steaks on the grill, and cook 7 minutes on each side, or to desired doneness."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d2",
        "user": "5d713995b721c3bb38c1f5d0",
        "name": "Fettuccini Carbonara",
        "averageRating": 1,
        "serving": 6,
        "calories": 614,
        "cousine": "Italian",
        "meat": true,
        "time": 35,
        "photo": "photo_5d713995b721c3bb38c1f5d2.jpg",
        "description": "This carbonara is a delectable, mouth watering pile of yummy goodness. I recommend a nice salad with it - that's all you will need for a complete meal.",
        "ingredients": ["5 teaspoons olive oil", "4 shallots, diced", "1 large onion, cut into thin strips", "1 pound bacon, cut into strips", "1 clove garlic, chopped", "1 (16 ounce) package fettuccini pasta", "3 egg yolks", "1/2 cup heavy cream", "3/4 cup shredded Parmesan cheese"],
        "instructions": "Heat olive oil in a large heavy saucepan over medium heat. Saute shallots until softened. Stir in onion and bacon, and cook until bacon is evenly browned. Stir in garlic when bacon is about half done. Remove from heat. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente. Drain pasta, then return it to the pot.In a medium bowl, whisk together egg yolks, cream, and shredded Parmesan. Pour the bacon mixture over the pasta, then stir in the cream mixture. Season with salt and pepper."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d9",
        "user": "5d713995b721c3bb38c1f5d1",
        "name": "Guacamole",
        "averageRating": 1,
        "serving": 4,
        "calories": 262,
        "cousine": "Mexican",
        "meat": false,
        "time": 10,
        "photo": "photo_5d713995b721c3bb38c1f5d9.jpg",
        "description": "ou can make this avocado salad smooth or chunky depending on your tastes.",
        "ingredients": ["3 avocados - peeled", "1 lime", "1/2 cup diced onion", "3 tablespoons chopped fresh cilantro", "1 teaspoon minced garlic", "2 tomatoes", "1 pinch ground cayenne pepper"],
        "instructions": "In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d4",
        "user": "5d713995b721c3bb38c1f5d1",
        "name": "Pad Thai",
        "averageRating": 1,
        "serving": 6,
        "calories": 560,
        "cousine": "Thai",
        "meat": true,
        "time": 60,
        "photo": "photo_5d713995b721c3bb38c1f5d4.jpg",
        "description": "This is a traditional Pad Thai recipe used by a friend's mother. You can use chicken, pork, beef, tofu, or a combination. You may want to start with less pepper, and work your way up.",
        "ingredients": ["1 (12 ounce) package rice noodles", "2 tablespoons butter", "1 pound boneless, skinless chicken breast halves, cut into bite-sized pieces", "¼ cup vegetable oil", "2 tablespoons fish sauce", "1 tablespoon white wine vinegar", "3 tablespoons white sugar", "⅛ tablespoon crushed red pepper", "2 cups bean sprouts", "¼ cup crushed peanuts", "3 green onions, chopped", "1 lemon, cut into wedges"],
        "instructions": "Soak rice noodles in cold water 30 to 50 minutes, or until soft. Drain, and set aside. Heat butter in a wok or large heavy skillet. Saute chicken until browned. Remove, and set aside. Heat oil in wok over medium-high heat. Crack eggs into hot oil, and cook until firm. Stir in chicken, and cook for 5 minutes. Add softened noodles, and vinegar, fish sauce, sugar and red pepper. Adjust seasonings to taste. Mix while cooking, until noodles are tender. Add bean sprouts, and mix for 3 minutes."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d5",
        "user": "5d713995b721c3bb38c1f5d1",
        "name": "Best Lasagna",
        "averageRating": 1,
        "serving": 12,
        "calories": 448,
        "cousine": "Italian",
        "meat": true,
        "time": 180,
        "photo": "photo_5d713995b721c3bb38c1f5d5.jpg",
        "description": "It takes a little work, but it is worth it.",
        "ingredients": ["1 pound sweet Italian sausage", "3/4 pound lean ground beef", "1/2 cup minced onion", "2 cloves garlic, crushed", "1 (28 ounce) can crushed tomatoes", "2 (6 ounce) cans tomato paste", "2 (6.5 ounce) cans canned tomato sauce", "1/2 cup water", "2 tablespoons white sugar", "1 1/2 teaspoons dried basil leaves", "1/2 teaspoon fennel seeds", "1 teaspoon Italian seasoning", "1 1/2 teaspoons salt, divided, or to taste", "1/4 teaspoon ground black pepper", "4 tablespoons chopped fresh parsley", "12 lasagna noodles", "16 ounces ricotta cheese", "1 egg", "3/4 pound mozzarella cheese, sliced", "3/4 cup grated Parmesan cheese"],
        "instructions": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. In a mixing bowl, combine ricotta cheese with egg, remaining parsley..."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d6",
        "user": "5d713995b721c3bb38c1f5d1",
        "name": "Fresh Tomato Salsa",
        "averageRating": 1,
        "serving": 4,
        "calories": 51,
        "cousine": "Mexican",
        "meat": false,
        "time": 60,
        "photo": "photo_5d713995b721c3bb38c1f5d6.jpg",
        "description": "This is a delicious homemade salsa.",
        "ingredients": ["3 tomatoes, chopped", "1/2 cup finely diced onion", "1/2 cup chopped fresh cilantro", "1 teaspoon salt", "5 serrano chiles, finely chopped", "2 teaspoons lime juice"],
        "instructions": "In a medium bowl, stir together tomatoes, onion, chili peppers, cilantro, salt, and lime juice. Chill for one hour in the refrigerator before serving."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d7",
        "user": "5d713995b721c3bb38c1f5d1",
        "name": "World's Best Lasagna",
        "averageRating": 1,
        "serving": 12,
        "calories": 500,
        "cousine": "Italian",
        "meat": true,
        "time": 180,
        "description": "It takes a little work, but it is worth it.",
        "ingredients": ["1 pound sweet Italian sausage", "¾ pound lean ground beef", "½ cup minced onion", "2 cloves garlic, crushed", "1 (28 ounce) can crushed tomatoes", "2 (6 ounce) cans tomato paste", "2 (6.5 ounce) cans canned tomato sauce", "½ cup water", "2 tablespoons white sugar", "1 ½ teaspoons dried basil leaves", "½ teaspoon fennel seeds", "1 teaspoon Italian seasoning", "1 ½ teaspoons salt, divided, or to taste", "¼ teaspoon ground black pepper", "4 tablespoons chopped fresh parsley", "12 lasagna noodles", "16 ounces ricotta cheese", "1 egg", "¾ pound mozzarella cheese, sliced", "¾ cup grated Parmesan cheese"],
        "instructions": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally. Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes.Drain noodles, and rinse with cold water. In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt. Preheat oven to 375 degrees F(190 degrees C). To assemble, spread 1 1 / 2 cups of meat sauce in the bottom of a 9 x13 inch baking dish.Arrange 6 noodles lengthwise over meat sauce.Spread with one half of the ricotta cheese mixture.Top with a third of mozzarella cheese slices.Spoon 1 1 / 2 cups meat sauce over mozzarella, and sprinkle with 1 / 4 cup Parmesan cheese.Repeat layers, and top with remaining mozzarella and Parmesan cheese.Cover with foil: to prevent sticking,either spray foil with cooking spray, or make sure the foil does not touch the cheese.Bake in preheated oven for 25 minutes.Remove foil, and bake an additional 25 minutes.Cool for 15 minutes before serving."
    },
    {
        "_id": "5d713995b721c3bb38c1f5d8",
        "user": "5d713995b721c3bb38c1f5d1",
        "name": "Spicy Chicken Thai Soup",
        "averageRating": 1,
        "serving": 6,
        "calories": 380,
        "cousine": "Mexican",
        "meat": true,
        "time": 60,
        "description": "Most of the ingredients for this Thai-inspired soup can be found in the supermarket. The red curry paste is spicy, but by controlling the amount of paste you add, you can tailor this to your own threshold of pain.",
        "ingredients": ["3 lemongrass stalks, bottom two-thirds of tender inner bulbs only, thinly sliced", "4 cloves garlic, chopped", "1 (4 inch) piece fresh ginger root, chopped", "4 cups chicken broth", "1 tablespoon vegetable oil", "2 ½ pounds skinless, boneless chicken thighs, cut into chunks", "12 ounces fresh white mushrooms, quartered", "2 teaspoons red curry paste", "3 tablespoons fish sauce", "1 lime, juiced2 (14 ounce) cans coconut milk", "1 red onion, sliced", "½ bunch cilantro, roughly chopped", "1 lime, cut into wedges, for serving", "1 fresh jalapeno pepper, sliced into rings"],
        "instructions": "Stir lemon grass, garlic, and ginger together in a large stock pot over medium-high heat. Stir in chicken broth and bring to a boil. Reduce heat to low and simmer for 30 minutes. Strain chicken broth and set aside. Discard lemon grass, garlic, and ginger. Heat vegetable oil in a large soup pot over medium heat; Stir in chicken; cook and stir for 5 minutes. Stir in mushrooms and cook for 5 more minutes. Stir in red curry paste, fish sauce, and lime juice until combined. Stir in chicken broth and coconut milk; return to a simmer and cook on low for 15 to 20 minutes. Skim off any excess oil and fat that rises to the top and discard. Stir red onion into the chicken mixture; cook and stir until onion softens, about 5 minutes. Remove from heat and add about 1/2 the cilantro. Serve with plates of cilantro, lime wedges, and fresh sliced jalapenos."
    },
    {
        "_id": "5d713995b721c3bb38c1f888",
        "user": "5d713995b721c3bb38c1f5d2",
        "name": "Thai Beef Salad",
        "averageRating": 1,
        "serving": 6,
        "calories": 211,
        "cousine": "Thai",
        "meat": true,
        "time": 185,
        "description": "A colorful, tangy salad that brings out the best in Thai cuisine and spices.",
        "ingredients": ["2 green onions", "chopped1 lemon grass, cut into 1 inch pieces", "1 cup chopped fresh cilantro", "1 cup chopped fresh mint leaves", "1 cup lime juice", "1/3 cup fish sauce", "1 tablespoon sweet chili sauce", "1/2 cup white sugar", "1 1/2 pounds (1 inch thick) steak fillet", "1 head leaf lettuce - rinsed, dried and torn into bite-size pieces", "1/2 English cucumber, diced", "1 pint cherry tomatoes"],
        "instructions": "In a large bowl, stir together the green onions, lemon grass, cilantro, mint leaves, lime juice, fish sauce, chili sauce and sugar until well combined and the sugar is dissolved. Adjust the flavor, if desired, by adding more sugar and/or fish sauce. Set aside. Cook the steak over high heat on a preheated grill for approximately 4-6 minutes on each side, until it is cooked medium. Do not overcook the meat! Remove from heat and slice into thin strips. Add the meat and its juices to the sauce and refrigerate, tightly covered, for at least 3 hours.Tear the lettuce into bite size pieces and place in a salad bowl. Arrange the cucumber on top of the lettuce, and then pour the meat and sauce over. Top with the cherry tomatoes and garnish with fresh cilantro leaves."
    },
    {
        "_id": "5d713995b721c3bb38c1f510",
        "user": "5d713995b721c3bb38c1f5d2",
        "name": "Buffalo Chicken Wings",
        "averageRating": 1,
        "serving": 8,
        "calories": 444,
        "cousine": "American",
        "meat": true,
        "time": 25,
        "description": "Let your palate fly away on wings of fire - easy, spicy buffalo wings!",
        "ingredients": ["1 quart vegetable oil for deep frying", "24 chicken wings, tips removed and wings cut in half at joint", "4 tablespoons butter", "1 tablespoon distilled white vinegar", "5 tablespoons hot pepper sauce", "salt and pepper to taste"],
        "instructions": "Heat the oil in a large skillet or deep fryer to 375 degrees F (190 degrees C). Deep fry chicken wings in oil until done, about 10 minutes. Remove chicken from skillet or deep fryer and drain on paper towels.Melt the butter in a large skillet. Stir in the, vinegar and hot pepper sauce. Season with salt and pepper to taste. Add cooked chicken to sauce and stir over low heat to coat. The longer the wings simmer in the sauce, the hotter they will be. Serve warm."
    },
    {
        "_id": "5d713995b721c3bb38c1f511",
        "user": "5d713995b721c3bb38c1f5d3",
        "name": "Blue Cheese Burgers",
        "averageRating": 1,
        "serving": 12,
        "calories": 348,
        "cousine": "American",
        "meat": true,
        "time": 145,
        "description": "Hamburgers? Yes. But basic fare? Definitely not! What a treat they are, and the wise cook will make up a dozen or so for the freezer. If you like blue cheese, you'll never forget these burgers.",
        "ingredients": ["3 pounds lean ground beef", "4 ounces blue cheese, crumbled", "1/2 cup minced fresh chives", "1/4 teaspoon hot pepper sauce", "1 teaspoon Worcestershire sauce", "1 teaspoon coarsely ground black pepper", "1 1/2 teaspoons salt", "1 teaspoon dry mustard", "12 French rolls or hamburger buns"],
        "instructions": "In a large bowl, mix the ground beef, blue cheese, chives, hot pepper sauce, Worcestershire sauce, black pepper, salt, and mustard. Cover, and refrigerate for 2 hours. Preheat grill for high heat. Gently form the burger mixture into about 12 patties. Oil the grill grate. Grill patties 5 minutes per side, or until well done. Serve on rolls."
    },
    {
        "_id": "5d713995b721c3bb38c1f512",
        "user": "5d713995b721c3bb38c1f5d3",
        "name": "Chef John's Shakshuka",
        "averageRating": 1,
        "serving": 6,
        "calories": 185,
        "cousine": "Mexican",
        "meat": false,
        "time": 45,
        "description": "This North African one-dish-meal is so fast, easy, and delicious. Be sure to cook your sauce until the veggies are nice and soft and sweet. Once the eggs go in, you can finish covered on the stove, or just pop the pan into a hot oven until they cook to your liking.",
        "ingredients": ["2 tablespoons olive oil", "1 large onion, diced", "1/2 cup sliced fresh mushrooms", "1 teaspoon salt, or more to taste", "1 cup diced red bell pepper", "1 jalapeno pepper, seeded and sliced", "1 teaspoon cumin", "1/2 teaspoon paprika", "1/2 teaspoon ground turmeric", "1/2 teaspoon freshly ground black pepper, plus more to taste", "1/4 teaspoon cayenne pepper", "1 (28 ounce) can crushed San Marzano tomatoes, or other high-quality plum tomatoes", "1/2 cup water, or more as needed", "6 large eggs", "2 tablespoons crumbled feta cheese", "2 tablespoons chopped fresh parsley"],
        "instructions": "Heat olive oil in a large, heavy skillet over medium-high heat. Add onions and mushrooms. Sprinkle with salt. Cook and stir until mushrooms release all of their liquid and start to brown, about 10 minutes. Stir in bell peppers and jalapeno pepper. Cook and stir until peppers begin to soften up, about 5 minutes. Season with cumin, paprika, turmeric, black pepper, and cayenne. Stir and cook to wake up the flavors, about 1 minute. Pour in crushed tomatoes and water. Adjust heat to medium and simmer uncovered until veggies are softened and sweet, stirring occasionally, 15 to 20 minutes. Add more water if sauce becomes too thick. Make a depression in the sauce for each egg with a large spoon. Crack egg into a small ramekin and slide gently into each indentation; repeat with the rest of the eggs. Season with salt and pepper. Cover and cook until eggs are to your desired doneness. Top with feta cheese and parsley."
    },
    {
        "_id": "5d713995b721c3bb38c1f513",
        "user": "5d713995b721c3bb38c1f5d3",
        "name": "Sushi Roll",
        "averageRating": 1,
        "serving": 8,
        "calories": 152,
        "cousine": "Japanese",
        "meat": false,
        "time": 45,
        "description": "Sushi can be filled with any ingredients you choose. Try smoked salmon instead of imitation crabmeat. Serve with teriyaki sauce and wasabi.",
        "ingredients": ["2/3 cup uncooked short-grain white rice", "3 tablespoons rice vinegar", "3 tablespoons white sugar", "1 1/2 teaspoons salt", "4 sheets nori seaweed sheets", "1/2 cucumber, peeled, cut into small strips", "2 tablespoons pickled ginger", "1 avocado", "1/2 pound imitation crabmeat, flaked"],
        "instructions": "In a medium saucepan, bring 1 1/3 cups water to a boil. Add rice, and stir. Reduce heat, cover, and simmer for 20 minutes. In a small bowl, mix the rice vinegar, sugar ,and salt. Blend the mixture into the rice. Preheat oven to 300 degrees F (150 degrees C). On a medium baking sheet, heat nori in the preheated oven 1 to 2 minutes, until warm. Center one sheet nori on a bamboo sushi mat. Wet your hands. Using your hands, spread a thin layer of rice on the sheet of nori, and press into a thin layer. Arrange 1/4 of the cucumber, ginger, avocado, and imitation crabmeat in a line down the center of the rice. Lift the end of the mat, and gently roll it over the ingredients, pressing gently. Roll it forward to make a complete roll. Repeat with remaining ingredients.Cut each roll into 4 to 6 slices using a wet, sharp knife."
    },
    {
        "_id": "5d713995b721c3bb38c1f514",
        "user": "5d713995b721c3bb38c1f5d3",
        "name": "Cucumber and Avocado Sushi",
        "averageRating": 1,
        "serving": 6,
        "calories": 171,
        "cousine": "Japanese",
        "meat": true,
        "time": 60,
        "description": "Cucumber and avocado sushi! These rolls are easy to make and you can add either fake crab or smoked salmon. Serve with teriyaki or soy sauce and wasabi!",
        "ingredients": ["1 1/4 cups water", "1 cup uncooked glutinous white rice (sushi rice)", "3 tablespoons rice vinegar", "1 pinch salt", "4 sheets nori (dry seaweed)", "1/2 cucumber, sliced into thin strips", "1 avocado - peeled, pitted and sliced"],
        "instructions": "Combine the water and rice in a saucepan and bring to a boil. Cover, reduce heat to low and simmer for 20 minutes, or until rice is tender and water has been absorbed. Remove from the heat and stir in the vinegar and a pinch of salt. Set aside to cool. Cover a bamboo sushi mat with plastic wrap to keep the rice from sticking. Place a sheet of seaweed over the plastic. Use your hands to spread the rice evenly onto the sheet, leaving about 1/2 inch of seaweed empty at the bottom. Arrange strips of cucumber and avocado across the center of the rice. Lift the mat and roll over the vegetables once and press down. Unroll, then roll again towards the exposed end of the seaweed sheet to make a long roll. You may moisten with a little water to help seal. Set aside and continue with remaining nori sheets, rice and fillings. Use a sharp wet knife to slice the rolls into 5 or 6 slices. Serve cut side up with your favorite sushi condiments."
    },
    {
        "_id": "5d713995b721c3bb38c1f515",
        "user": "5d713995b721c3bb38c1f5d4",
        "name": "Spicy Crab Spring Rolls",
        "averageRating": 1,
        "serving": 4,
        "calories": 100,
        "cousine": "Japanese",
        "meat": true,
        "time": 50,
        "description": "This is a cross between a spicy sushi crab roll and a spring roll. Quick and easy to make with fresh ingredients. Also good with shrimp instead of crab. Serve with ponzu or sweet chile sauce for dipping",
        "ingredients": ["3/4 cup imitation crabmeat", "1 1/2 tablespoons mayonnaise", "1 teaspoon sriracha sauce, or to taste", "4 rice paper wrappers", "1/3 English cucumber, cut into matchsticks", "1 carrot, cut into matchsticks", "1/2 ripe avocado, sliced lengthwise into 8 pieces"],
        "instructions": "Shred crabmeat using 2 forks or in a food processor.Mix crabmeat, mayonnaise, and sriracha sauce together in a small bowl.Fill a shallow bowl with hot water to a depth of 2 inches. Dip 1 rice paper wrapper in the water for a few seconds to soften; set on a wooden cutting board or a clean, moist dish towel. Layer 1/4 of the cucumber, carrot, avocado, crabmeat mixture, and green onion in the bottom third of the rice paper.Pull bottom of the rice paper over the filling, using your fingers to prevent it from spilling out the sides. Fold opposing edges of the rice paper to overlap the filling; roll up tightly towards the top. Place roll seam-side down on a plate. Repeat with remaining rice papers and cucumber, carrot, avocado, crabmeat mixture, and green onion."
    },
    {
        "_id": "5d713995b721c3bb38c1f516",
        "user": "5d713995b721c3bb38c1f5d4",
        "name": "Butcher's Steak",
        "averageRating": 1,
        "serving": 4,
        "calories": 340,
        "cousine": "American",
        "meat": true,
        "time": 50,
        "description": "Butcher (or hanger) steak is great pan cooked, broiled, or grilled. It takes to marinades wonderfully, and really can be substituted for any cut of steak. Just be sure to take the time to trim it well.",
        "ingredients": ["1 (2 pound) butcher's steak (hanger steak)", "salt and freshly ground black pepper to taste", "1 tablespoon clarified butter", "⅔ cup chicken broth", "2 teaspoons balsamic vinegar", "2 tablespoons cold butter, cut into cubes", "salt to taste"],
        "instructions": "Remove all silver skin and extra fat from the steak. Carefully cut out the connective tissue that connects the 2 halves of the steak, separating the whole into 2 long pieces. Cut lobe of meat from one half (it's a piece that is slightly separated from the larger half). Then cut each of the 2 larger halves into 2 steaks each. Sprinkle with salt and pepper. Heat skillet over high heat. Add clarified butter when pan is hot, then place the steaks in the pan. Reduce heat to medium. Cook until browned on all sides, firm, and reddish-pink on the inside. An instant-read thermometer inserted into the center should read 125 degrees F (52 degrees C), a total of about 12 minutes. (This cut of meat has a sort of triangular shape, so about 4 minutes per side.) Transfer to a warm plate and tent with foil to let steaks rest and allow temperature to rise to 130 degrees F. Pour stock into skillet set over medium heat. Stir with a wooden spoon scraping up the browned bits from the bottom. When brownings dissolve and liquid begins to reduce after 2 or 3 minutes, reduce heat to low. Add accumulated juices from the meat, balsamic vinegar, and butter chunks. Cook and stir until butter melts. If liquid has reduced too much, add a splash of broth. Taste to check if sauce needs a bit of salt."
    },
    {
        "_id": "5d713995b721c3bb38c1f517",
        "user": "5d713995b721c3bb38c1f5d4",
        "name": "Ribeye Steak",
        "averageRating": 1,
        "serving": 6,
        "calories": 352,
        "cousine": "American",
        "meat": true,
        "time": 30,
        "description": "Salting the ribeye steak two days prior to cooking brines the steak, helps tenderize it, and adds rich flavor.",
        "ingredients": ["6 (8 ounce) rib-eye steaks", "1 tablespoon Diamond Crystal® Kosher Salt", "1 1/2 teaspoons ground black pepper", "1 tablespoon vegetable oil, or as needed", "2 tablespoons unsalted butter"],
        "instructions": "Two days before cooking, salt both sides of each steak with 1/2 teaspoon Diamond Crystal(R) Kosher Salt per steak. Place steaks in an airtight container and refrigerate until ready to cook. Remove the steaks from the refrigerator about 30 minutes prior to cooking. Sprinkle both sides of steak with black pepper.Heat cast iron pan over medium-high heat until very hot. Add vegetable oil and heat until oil shimmers. Carefully place steaks in pan. Cook until brown and hard-seared on one side, 4 to 5 minutes.Turn steaks and top with one teaspoon butter. Cook for 3 to 4 more minutes or to desired doneness. You may need to cook the steaks in batches depending on the size of your cast iron pan. Keep the cooked steaks in a 170 degree F oven until ready to serve."
    },
    {
        "_id": "5d713995b721c3bb38c1f518",
        "user": "5d713995b721c3bb38c1f5d4",
        "name": "French Toast Stars",
        "averageRating": 1,
        "serving": 4,
        "calories": 358,
        "cousine": "French",
        "meat": false,
        "time": 25,
        "description": "A fruity, yummy, festive breakfast! You can substitute flavorings easily to make different variations, and even change the shape! Serve with syrup, whipped cream, powdered sugar and fruit.",
        "ingredients": ["8 thick slices white bread", "2 eggs", "1/4 cup heavy cream", "2 tablespoons honey", "1/4 teaspoon salt", "1/4 teaspoon ground cinnamon", "1 tablespoon grated orange zest", "1/2 teaspoon vanilla extract", "3 tablespoons butter"],
        "instructions": "Place a slice of bread on a cutting board. Align a star-shaped cookie cutter in the center of the slice. Push the cookie cutter through the bread, rocking it gently back and forth. Once the cookie cutter makes it all the way through bread, remove bread outside the cutter. Hold the cutter down on the bread during this step to prevent the star from tearing. Use a sharp knife to trim any bread that lingers outside the cookie cutter. Gently remove the star from the cutter and put aside. Repeat on all slices of bread. In a medium bowl, beat together eggs, whipping cream, honey, salt, cinnamon, orange zest and vanilla extract. In a griddle or frying pan, melt the butter over medium high heat. Dip both sides of the stars in the egg mixture and carefully transfer to the hot griddle. Brown on both sides and transfer to a warm plate while remaining stars cook. Serve hot."
    }
]